/*
 * 1. Реализовать перевод из 10 в 2 систему счисления с использованием стека.
 */

#include <stdio.h>
#include "decimal_to_binary.h"

void task_1() {
    int decimal;
    printf("please enter a decimal to covert: ");
    scanf("%d", &decimal);
}
